app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 32], ["created_at", "2020-06-25 12:00:20.009699"], ["updated_at", "2020-06-25 12:00:20.009699"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 2], ["updated_at", "2020-06-25 12:13:58.841688"], ["id", 6]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title, :room_number))