app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Billy"], ["last_name", "Buckets"], ["created_at", "2020-06-25 11:25:31.292168"], ["updated_at", "2020-06-25 11:25:31.292168"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Pro"], ["updated_at", "2020-06-25 11:45:16.030422"], ["id", 9]]